In [1]:
import numpy as np
import pandas as pd

In [7]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
dtype: object

In [9]:
#creating series with a numpy array

days_list = np.array(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
dtype: object

In [10]:
#Using strings as index

index = ['a', 'b', 'c', 'd', 'e']

In [11]:
#Create series from Dictionary

days_1 = pd.Series({'a':'Monday', 'b':'Tuesday', 'c':'Wednesday', 'd':'Thursday', 'e':'Friday'})

In [12]:
print(days_1)

a       Monday
b      Tuesday
c    Wednesday
d     Thursday
e       Friday
dtype: object

In [13]:
days_1[1]

'Tuesday'

In [14]:
days_1[:2]

a     Monday
b    Tuesday
dtype: object

In [15]:
days_1[1:4]

b      Tuesday
c    Wednesday
d     Thursday
dtype: object

In [16]:
days_1['c']

'Wednesday'

In [17]:
#print dataframe

print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [18]:
#Creating a dataframe from a dictionary

df_dict = {
    'Country': ['Nigeria', 'Ghana', 'Australia', 'Austria', 'Poland', 'Mexico', 'Brazil', 'China'],
    'Continent': ['Africa', 'Africa', 'Australasia', 'Europe', 'Europe', 'North America', 'South America', 'Asia'],
    'Capital': ['Abuja', 'Accra', 'Canberra', 'Vienna', 'Warsaw', 'Mexico', 'Rio De Janeiro', 'Shanghai'],
    'Population': [200000, 100000, 50000, 30000, 25000, 150000, 300000, 600000],
    'Age': [60, 70, 40, 30, 55, 80, 77, 45]
}

In [19]:
print(df_dict)

{'Country': ['Nigeria', 'Ghana', 'Australia', 'Austria', 'Poland', 'Mexico', 'Brazil', 'China'], 'Continent': ['Africa', 'Africa', 'Australasia', 'Europe', 'Europe', 'North America', 'South America', 'Asia'], 'Capital': ['Abuja', 'Accra', 'Canberra', 'Vienna', 'Warsaw', 'Mexico', 'Rio De Janeiro', 'Shanghai'], 'Population': [200000, 100000, 50000, 30000, 25000, 150000, 300000, 600000], 'Age': [60, 70, 40, 30, 55, 80, 77, 45]}

In [21]:
df = pd.DataFrame(df_dict, index = [2,4,6,8,10,12,14,16])
print(df)

      Country      Continent         Capital  Population  Age
2     Nigeria         Africa           Abuja      200000   60
4       Ghana         Africa           Accra      100000   70
6   Australia    Australasia        Canberra       50000   40
8     Austria         Europe          Vienna       30000   30
10     Poland         Europe          Warsaw       25000   55
12     Mexico  North America          Mexico      150000   80
14     Brazil  South America  Rio De Janeiro      300000   77
16      China           Asia        Shanghai      600000   45

In [22]:
#Creating a list

df_list = [['Nigeria', 'Africa', 'Abuja', 200000, 60],
          ['Ghana', 'Africa', 'Accra', 100000, 70],
          ['Australia', 'Australasia', 'Canberra', 50000, 40],
          ['Austria', 'Europe', 'Vienna', 30000, 30],
          ['Poland', 'Europe', 'Warsaw', 25000, 55],
          ['Mexico', 'North America', 'Mexico', 150000, 80],
          ['Brazil', 'South America', 'Rio De Janeiro', 300000, 77],
          ['China','Asia', 'Shanghai', 600000, 45]]

In [23]:
#Creating a Column and index

df_1 = pd.DataFrame(df_list, columns = ['Country', 'Continent', 'Capital', 'Population', 'Age'], 
                    index = [2,4,6,8,10,12,14,16])

In [25]:
print(df)

      Country      Continent         Capital  Population  Age
2     Nigeria         Africa           Abuja      200000   60
4       Ghana         Africa           Accra      100000   70
6   Australia    Australasia        Canberra       50000   40
8     Austria         Europe          Vienna       30000   30
10     Poland         Europe          Warsaw       25000   55
12     Mexico  North America          Mexico      150000   80
14     Brazil  South America  Rio De Janeiro      300000   77
16      China           Asia        Shanghai      600000   45

In [26]:
print(df_1)

      Country      Continent         Capital  Population  Age
2     Nigeria         Africa           Abuja      200000   60
4       Ghana         Africa           Accra      100000   70
6   Australia    Australasia        Canberra       50000   40
8     Austria         Europe          Vienna       30000   30
10     Poland         Europe          Warsaw       25000   55
12     Mexico  North America          Mexico      150000   80
14     Brazil  South America  Rio De Janeiro      300000   77
16      China           Asia        Shanghai      600000   45

In [29]:
#to select rows at index 3

df.iloc[3]

Country       Austria
Continent      Europe
Capital        Vienna
Population      30000
Age                30
Name: 8, dtype: object

In [31]:
df.loc[4]

#To select with a particular index tag

Country        Ghana
Continent     Africa
Capital        Accra
Population    100000
Age               70
Name: 4, dtype: object

In [33]:
#Distinct selection

df['Capital']

2              Abuja
4              Accra
6           Canberra
8             Vienna
10            Warsaw
12            Mexico
14    Rio De Janeiro
16          Shanghai
Name: Capital, dtype: object

In [34]:
df_1['Continent']

2            Africa
4            Africa
6       Australasia
8            Europe
10           Europe
12    North America
14    South America
16             Asia
Name: Continent, dtype: object

In [35]:
df.at[6, 'Country']

'Australia'

In [36]:
df.at[10, 'Continent']

'Europe'

In [40]:
df.iat[4, 3]

25000

In [42]:
df.describe()

         Population        Age
count       8.00000   8.000000
mean   181875.00000  57.125000
std    193426.57337  18.019335
min     25000.00000  30.000000
25%     45000.00000  43.750000
50%    125000.00000  57.500000
75%    225000.00000  71.750000
max    600000.00000  80.000000

In [43]:
df['Population'].sum()

1455000

In [45]:
df.mean()

Population    181875.000
Age               57.125
dtype: float64

In [49]:
#Missing Values
df_dict2 = {
  'Name': ['James', 'Kolawole', 'Dtunes', np.nan],
    'Profession': ['Librarian', 'Teacher', 'Musician', 'Writer'],
    'Experience': [12, np.nan, 10, 8],
    'Height': [np.nan, 5.81, 6.0, 5.3]
}

In [50]:
new_df = pd.DataFrame(df_dict2)

In [51]:
print(new_df)

       Name Profession  Experience  Height
0     James  Librarian        12.0     NaN
1  Kolawole    Teacher         NaN    5.81
2    Dtunes   Musician        10.0    6.00
3       NaN     Writer         8.0    5.30

In [52]:
#Check for cells for Missing Values
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [53]:
#Remove rows for missing value

new_df.dropna()

     Name Profession  Experience  Height
2  Dtunes   Musician        10.0     6.0